nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1010/driver_examples/kpp/pin_mux.c
/*
 * Copyright 2019 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MIMXRT1011xxxxx
package_id: MIMXRT1011DAE5A
mcu_data: ksdk2_0
processor_version: 9.0.1
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: LPUART1, signal: RXD, pin_signal: GPIO_09, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, drive_strength: R0_4,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '2', peripheral: LPUART1, signal: TXD, pin_signal: GPIO_10, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, drive_strength: R0_4,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '52', peripheral: KPP, signal: 'kpp_col, 1', pin_signal: GPIO_AD_06, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, drive_strength: R0_4,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '56', peripheral: KPP, signal: 'kpp_col, 2', pin_signal: GPIO_AD_04, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, drive_strength: R0_4,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '11', peripheral: KPP, signal: 'kpp_col, 3', pin_signal: GPIO_02, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, drive_strength: R0_4,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '55', peripheral: KPP, signal: 'kpp_row, 1', pin_signal: GPIO_AD_05, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, drive_strength: R0_4,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '57', peripheral: KPP, signal: 'kpp_row, 2', pin_signal: GPIO_AD_03, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, drive_strength: R0_4,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '12', peripheral: KPP, signal: 'kpp_row, 3', pin_signal: GPIO_01, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, drive_strength: R0_4,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm, hysteresis_enable: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  IOMUXC_SetPinMux(IOMUXC_GPIO_01_KPP_ROW03, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_02_KPP_COL03, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_09_LPUART1_RXD, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_10_LPUART1_TXD, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_03_KPP_ROW02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_04_KPP_COL02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_05_KPP_ROW01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_06_KPP_COL01, 0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_01_KPP_ROW03, 0x70A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_02_KPP_COL03, 0x10A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_09_LPUART1_RXD, 0x10A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_10_LPUART1_TXD, 0x10A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_03_KPP_ROW02, 0x70A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_04_KPP_COL02, 0x10A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_05_KPP_ROW01, 0x70A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_06_KPP_COL01, 0x10A0U); 
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
